app/controllers/circuits_controller.rb

  def index
    @circuits = Circuit.all
---
SELECT "circuits".* FROM "circuits"

  def create
    @circuit = Circuit.new(circuit_params)
    temp = @circuit.evaluate(@circuit.input)
    @circuit.output = temp[0]
    @circuit.input = temp[1]
    if params[:required]
        @circuit.required = true
      else
        @circuit.required = false
      end
    respond_to do |format|
      if @circuit.save
---
INSERT INTO "circuits" ("created_at", "input", "output", "required", "updated_at") VALUES (?, ?, ?, ?, ?)

  def download_input
    circuit = Circuit.find(params[:id])
---
SELECT "circuits".* FROM "circuits" WHERE "circuits"."id" = ? LIMIT 1  [["id", "1"]]

  def download_output
    circuit = Circuit.find(params[:id])
---
SELECT "circuits".* FROM "circuits" WHERE "circuits"."id" = ? LIMIT 1  [["id", "1"]]

  def upload
    @circuit = Circuit.new
    @circuit.input = params[:input].read
    temp = @circuit.evaluate(@circuit.input)
    @circuit.output = temp[0]
    @circuit.input = temp[1]
    if params[:required]
      @circuit.required = true
    else
      @circuit.required = false
    end
    respond_to do |format|
      if @circuit.save
---
INSERT INTO "circuits" ("created_at", "input", "output", "required", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_circuit
      @circuit = Circuit.find(params[:id])
---
SELECT "circuits".* FROM "circuits" WHERE "circuits"."id" = ? LIMIT 1  [["id", "1"]]